tutorials/incompressible/pimpleRemeshFoam/flapped_0010-64/systemid_angularOscillation/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (1 0 0);

boundaryField
{
    flap
    {
        type            noSlip;
    }
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }
    main
    {
        type            noSlip;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
