tutorials/incompressible/pimpleRemeshFoam/flapped_0010-64/systemid_angularOscillation/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 6.1605e-05;

boundaryField
{
    flap
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 6.1605e-05;
    }
    main
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
